Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Access your application.
ja_jp: アプリケーションにアクセスします。

source: Access-log handler, if enabled in the configuration.
ja_jp: コンフィギュレーションで有効になっていれば、アクセスログハンドラ。

source: Accessible without authentication, this endpoint allows anonymous access.
ja_jp: このエンドポイントは認証なしでアクセス可能で、匿名アクセスを使用できます。

source: Accessing Config Properties
ja_jp: 設定プロパティーへのアクセス

source: Accessing ID and Access Tokens
ja_jp: ID とアクセストークンへのアクセス

source: Accessing ID and access tokens
ja_jp: ID およびアクセストークンへのアクセス

source: Accessing JWT claims
ja_jp: JWT クレームへのアクセス

source: Accessing Kafka clients directly
ja_jp: Kafka クライアントへの直接アクセス

source: Accessing Static Fields and Methods
ja_jp: 静的なフィールドとメソッドへのアクセス

source: Accessing `/api/admin` returns a `200` status code.
ja_jp: `/api/admin` にアクセスすると、ステータスコード `200` が返されます。

source: Accessing `/api/admin` returns a `403` status code.
ja_jp: `/api/admin` にアクセスすると、ステータスコード `403` が返されます。

source: Accessing `/api/users/me` returns a `200` status code.
ja_jp: `/api/users/me` にアクセスすると、ステータスコード `200` が返されます。

source: Accessing a Cassandra database from a client application is easy with Quarkus and the Cassandra extension, which provides configuration and native support for the DataStax Java driver for Apache Cassandra.
ja_jp: クライアント・アプリケーションからのCassandraデータベースへのアクセスは、QuarkusとCassandraエクステンションで簡単に行えます。

source: Accessing a generating UUID
ja_jp: 生成中の UUID へのアクセス

source: Accessing an Elasticsearch cluster from a low level or a high level client is easy with Quarkus as it provides easy configuration, CDI integration and native support for it.
ja_jp: Quarkusでは、簡単な設定、CDIの統合、ネイティブサポートが提供されているため、低レベルまたは高レベルのクライアントからElasticsearchクラスターにアクセスすることが簡単にできます。

source: Accessing an Elasticsearch cluster from the low level REST client or the Elasticsearch Java client is easy with Quarkus as it provides easy configuration, CDI integration and native support for it.
ja_jp: Quarkusで低レベルのRESTクライアントやElasticsearchのJavaクライアントからElasticsearchクラスタにアクセスするのは簡単です。簡単な設定、CDI統合、ネイティブサポートが提供されている為です。

source: Accessing application properties with Spring Boot properties API
ja_jp: Spring BootプロパティAPIでアプリケーションのプロパティにアクセスする

source: Accessing authorization data
ja_jp: 認可データへのアクセス

source: Accessing context objects
ja_jp: コンテキストオブジェクトへのアクセス

source: Accessing request parameters
ja_jp: リクエストパラメーターへのアクセス

source: Accessing the Keycloak server
ja_jp: Keycloak サーバーへのアクセス

source: Accessing the OIDC configuration information
ja_jp: OIDC 設定情報へのアクセス

source: Accessing the Vert.x instance
ja_jp: Vert.xインスタンスへのアクセス

source: Accessing the `/api/admin` endpoint
ja_jp: `/api/admin` エンドポイントへのアクセス

source: Accessing the `/api/users/me` endpoint
ja_jp: `/api/users/me` エンドポイントへのアクセス

source: Accessing the `EntityManagerFactory`/`EntityManager` or `SessionFactory`/`Session` will cause an exception to be thrown.
ja_jp: `EntityManagerFactory`/`EntityManager` または `SessionFactory`/`Session` にアクセスすると、例外がスローされます。

source: Accessing the `Metadata`, on the other hand, can be practical in many cases. Connectors add specific metadata objects to the message to give access to the message headers, properties, and other connector-specific information. You do not need to interact with the `Message` interface to access connector-specific metadata. You can simply inject the metadata object as a method parameter after the payload parameter:
ja_jp: 一方、`Metadata` にアクセスすることは、多くの場合実用的です。 コネクターは、メッセージヘッダー、プロパティー、およびその他のコネクター固有の情報にアクセスできるように、特定のメタデータオブジェクトをメッセージに追加します。 コネクター固有のメタデータにアクセスするために、`Message` インターフェイスを操作する必要はありません。 ペイロードパラメーターの後に、メタデータオブジェクトをメソッドパラメーターとして挿入するだけになります。

source: Accessing the mailer
ja_jp: Mailerへのアクセス

source: Accessing the managed Vert.x instance
ja_jp: Vert.xマネージドインスタンスへのアクセス

source: Accessing the request body
ja_jp: リクエストボディへのアクセス

source: Accessing to the Infinispan Server Console
ja_jp: Infinispan Server Consoleへのアクセス

source: According to RFC7519, JSON Web Token (JWT) is a compact, URL-safe means of representing claims which are encoded as a JSON object that is used as the payload of a JSON Web Signature (JWS) structure or as the plaintext of a JSON Web Encryption (JWE) structure, enabling the claims to be digitally signed or integrity protected with a Message Authentication Code(MAC) and/or encrypted.
ja_jp: RFC7519 によると、JSON Web トークン (JWT) は、JSON Web 署名 (JWS) 構造のペイロードとして、または JSON のプレーンテキストとして使用される JSON オブジェクトとしてエンコードされるクレームを表す、コンパクトで URL セーフな手段です。 Web 暗号化 (JWE) 構造により、クレームをデジタル署名したり、メッセージ認証コード (MAC) で完全性を保護したり、暗号化したりできます。

source: According to link:https://datatracker.ietf.org/doc/html/rfc7519[RFC7519], JSON Web Token (JWT) is a compact, URL-safe means of representing claims which are encoded as a JSON object that is used as the payload of a JSON Web Signature (JWS) structure or as the plaintext of a JSON Web Encryption (JWE) structure, enabling the claims to be digitally signed or integrity protected with a Message Authentication Code(MAC) and/or encrypted.
ja_jp: link:https://datatracker.ietf.org/doc/html/rfc7519[RFC7519] によると、JSON Web Token (JWT) は、使用される JSON オブジェクトとしてエンコードされたクレームを表すコンパクトで URL セーフな手段です。JSON Web Signature (JWS) 構造のペイロードとして、または JSON Web Encryption (JWE) 構造のプレーンテキストとして、クレームにデジタル署名したり、メッセージ認証コード (MAC) で完全に保護したり、暗号化したりできます。

source: According to link:{vthreadjep}[JEP 425] this can happen in two situations:
ja_jp: link:{vthreadjep}[JEP 425] によると、これは2つの状況で発生する場合があります:

source: According to link:{vthreadjep}[JEP 425], pinning can happen in the following situations:
ja_jp: link:{vthreadjep}[JEP 425] によると、ピニングは以下の状況で発生する可能性があります。

source: According to the https://docs.aws.amazon.com/linux/al2023/ug/system-requirements.html#system-requirements-cpu-x86-64[AWS documentation], AL2023 x86-64 binaries are built for the x86-64-**v2** revision of the x86-64 architecture. In Quarkus, the default value of xref:building-native-image.adoc#quarkus-core_quarkus-native-march[quarkus.native.march] is x86-64-**v3**. This could cause https://repost.aws/questions/QUBVnl6hn-Toe1LPr1qjOXzg/lambda-failed-with-java-compiled-into-machine-code[issues] if AWS Lambda provisions older hardware. To maximize Lambda compatibility, you can set `quarkus.native.march` to `x86-64-v2`. See the xref:native-reference.adoc#work-around-missing-cpu-features[Native Reference] guide for more information.
ja_jp: https://docs.aws.amazon.com/linux/al2023/ug/system-requirements.html#system-requirements-cpu-x86-64[AWS ドキュメント] によると、AL2023 x86-64 バイナリーは、x86-64 アーキテクチャーの x86-64-**v2** リビジョン用に構築されています。 Quarkus では、xref:building-native-image.adoc#quarkus-core_quarkus-native-march[quarkus.native.march] のデフォルト値は x86-64-**v3** です。 これが原因で、 https://repost.aws/questions/QUBVnl6hn-Toe1LPr1qjOXzg/lambda-failed-with-java-compiled-into-machine-code[issues] AWS Lambda が古いバージョンのハードウェア をプロビジョニングする場合 Lambda の互換性を最大限に高めるには、 `quarkus.native.march` を `x86-64-v2` に設定できます。 詳細は、xref:native-reference.adoc#work-around-missing-cpu-features[ネイティブリファレンス] ガイドを参照してください。

source: According to the https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-Initiated Logout] specification, the `quarkus.oidc.logout.post-logout-path` property is represented as a `post_logout_redirect_uri` query parameter which will not be recognized by the providers which do not support this specification.
ja_jp: https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-Initiated Logout] 仕様によると、 `quarkus.oidc.logout.post-logout-path` プロパティ－は `post_logout_redirect_uri` クエリパラメータとして表され、この仕様をサポートしていないプロバイダ－では認識されません。

source: According to the https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-initiated logout] specification, the `quarkus.oidc.logout.post-logout-path` property is represented as a `post_logout_redirect_uri` query parameter, which is not recognized by the providers that do not support this specification.
ja_jp: https://openid.net/specs/openid-connect-session-1_0.html#RPLogout[RP-initiated ログアウト] 仕様によれば、 `quarkus.oidc.logout.post-logout-path` プロパティーは `post_logout_redirect_uri` クエリーパラメーターとして表されますが、この仕様をサポートしていないプロバイダーでは認識されません。

source: Acknowledgement
ja_jp: 謝辞

source: Acknowledgement Strategies
ja_jp: 確認応答ストラテジー

source: Acknowledgement timeout
ja_jp: 確認応答タイムアウト

source: Acknowledgements
ja_jp: 謝辞

source: Acknowledgment Strategies
ja_jp: 確認応答ストラテジー

source: Acknowledgments
ja_jp: 謝辞

source: Acquiring a certificate
ja_jp: 証明書の取得

source: Action
ja_jp: アクション

source: Actions are really a JsonRPC Method that takes a workspace item as input.
ja_jp: アクションは、ワークスペース項目を入力として受け取る JsonRPC メソッドです。

source: Activate Request Context
ja_jp: リクエストコンテキストのアクティブ化

source: Activate or deactivate Mongo Clients
ja_jp: Mongo クライアントのアクティブ化または非アクティブ化

source: Activate or deactivate Redis Clients
ja_jp: Redis クライアントの有効化または無効化

source: Activate or deactivate datasources
ja_jp: データソースをアクティブ化または非アクティブ化する

source: Activate/deactivate Hibernate Search
ja_jp: Hibernate Search のアクティブ化/非アクティブ化

source: Activate/deactivate datasources
ja_jp: データソースの有効化/無効化

source: Activate/deactivate persistence units
ja_jp: 永続化ユニットのアクティブ化/非アクティブ化

source: Activating code completion on the `@Fallback(fallbackMethod)` value will get the list of available methods being proposed:
ja_jp: `@Fallback(fallbackMethod)` の値でコード補完を有効にすると、提案されている利用可能なメソッドのリストが表示されます。

source: Activating the CDI request context
ja_jp: CDI リクエストコンテキストの有効化

source: Activating this feature can expose the server to security issues like information spoofing. Activate it only when running behind a reverse proxy.
ja_jp: この機能を有効にすると、サーバーが情報詐称などのセキュリティ上の問題にさらされる可能性があります。リバースプロキシーの後ろで実行する場合のみ有効にしてください。

source: Activating this feature leaves the server exposed to several security issues (i.e. information spoofing). Consider activate it only when running behind a reverse proxy.
ja_jp: この機能を有効にすると、サーバーはいくつかのセキュリティ上の問題（情報の偽装など）にさらされます。リバースプロキシーを利用している場合のみ、この機能を有効にすることを検討してください。

source: ActiveMQ Artemis is part of `quarkus-pooled-jms`, and it needs to use `quarkus.pooled-jms.transaction=XA`.
ja_jp: ActiveMQ Artemis は `quarkus-pooled-jms` の一部であり、 `quarkus.pooled-jms.transaction=XA` を使用する必要があります。

source: Adapt to Scalar
ja_jp: スカラーへの変換

source: Adapt with
ja_jp: AdaptWithによる変換

source: Adapter
ja_jp: アダプター

source: Adapting
ja_jp: 変換

source: Adapting a complex object to a Scalar type:
ja_jp: 複雑なオブジェクトをスカラー型にマッピングします:

source: Adapting an existing Scalar to another type:
ja_jp: 既存のスカラーを別のタイプに変換します。

source: Add HTTP headers for specific paths
ja_jp: 特定のパスに対しHTTPヘッダを追加

source: Add Mutiny-based APIs
ja_jp: Mutiny ベースの API の追加

source: Add `@Singleton` as default scope. Classes already annotated with a scope are skipped automatically.
ja_jp: デフォルトのスコープとして `@Singleton` を追加。既にスコープでアノテーションされているクラスは自動的にスキップされます。

source: Add `appendResourceVersionInObject` for CRD objects https://github.com/fabric8io/kubernetes-client/pull/2365[#2365] (merged)
ja_jp: CRDオブジェクトに `appendResourceVersionInObject` を追加 link:https://github.com/fabric8io/kubernetes-client/pull/2365[#2365](merged)

source: Add `import org.jboss.logmanager.MDC;`
ja_jp: `import org.jboss.logmanager.MDC;` を追加します。

source: Add `openid` scope
ja_jp: `openid` スコープの追加

source: Add `org.eclipse.microprofile.graphql.GraphQLApi` to the set of bean defining annotations.
ja_jp: Bean 定義アノテーションのセットに `org.eclipse.microprofile.graphql.GraphQLApi` を追加します。

source: Add `quarkus-extension-process` as an annotation processor to both modules.
ja_jp: 両方のモジュールに `quarkus-extension-process` をアノテーション プロセッサーとして追加します。

source: Add `quarkus-extension-process` as annotation processor to both modules.
ja_jp: 両方のモジュールに `quarkus-extension-process` をアノテーションプロセッサーとして追加します。

source: Add `quarkus-jaxb` as a dependency in your Maven `pom.xml`, or Gradle `build.gradle` file.
ja_jp: `quarkus-jaxb` を依存関係として Maven `pom.xml` または Gradle `build.gradle` ファイルに追加します。

source: Add `quarkus.kafka.snappy.enabled=true` to your `application.properties`
ja_jp: `application.properties` に `quarkus.kafka.snappy.enabled=true` を追加している

source: Add a Counter
ja_jp: カウンターの追加

source: Add a Gauge
ja_jp: ゲージの追加

source: Add a REST resource with the following code (example courtesy of link:https://github.com/apangin/java-profiling-presentation/blob/master/src/demo1/StringBuilderTest.java[Andrei Pangin's Java Profiling presentation]):
ja_jp: 次のコードを使用して REST リソースを追加します (この例は link:https://github.com/apangin/java-profiling-presentation/blob/master/src/demo1/StringBuilderTest.java[Andrei Pangin's Java Profiling presentation] からご提供いただいています):

source: Add a SAML provider to Keycloak:
ja_jp: Keycloak に SAML プロバイダーを追加します。

source: Add a SQL migration file named `src/main/resources/db/migration/V2.0.0\__QuarkusQuartzTasks.sql` with the content copied from file with the content from link:{quickstarts-blob-url}/quartz-quickstart/src/main/resources/db/migration/V2.0.0__QuarkusQuartzTasks.sql[V2.0.0__QuarkusQuartzTasks.sql].
ja_jp: link:{quickstarts-blob-url}/quartz-quickstart/src/main/resources/db/migration/V2.0.0__QuarkusQuartzTasks.sql[V2.0.0.0__QuarkusQuartzTasks.sql] からコピーした内容でファイルからコピーした内容で `src/main/resources/db/migration/V2.0.0__QuarkusQuartzTasks.sql` という名前のSQLマイグレーションファイルを追加します。

source: Add a SQL migration to the default folder following the Flyway naming conventions: `{migrations-path}/V1.0.0__Quarkus.sql`
ja_jp: `{migrations-path}/V1.0.0__Quarkus.sql` のように Flyway の命名規則に従って、デフォルトフォルダーに SQL マイグレーションを追加します。

source: Add a Timer
ja_jp: タイマーの追加

source: Add a `%prod.` prefix to the database configuration. This means the configuration only applies to the xref:config-reference.adoc#profiles[prod profile]
ja_jp: `%prod.` を追加します。 データベース設定の接頭辞。これは、この設定が xref:config-reference.adoc#profiles[本番プロファイル] にのみ適用されることを意味します。

source: Add a `media-library` permission that was created can perform `read`, `write`, and `list` actions. Because `MediaLibrary` is the `TvLibrary` class parent, a user with the `admin` role is also permitted to modify `TvLibrary`.
ja_jp: 作成された権限 `media-library` を追加すると、 `read`、 `write`、および `list` アクションを実行できます。 `MediaLibrary` は `TvLibrary` クラスの親であるため、 `admin` ロールを持つユーザーも `TvLibrary` を変更することが許可されます。

source: Add a `optaplanner-test` dependency in your build file:
ja_jp: ビルドファイルに `optaplanner-test` 依存関係を追加します。

source: Add a build step in your deployment module that produces a `HealthBuildItem`.
ja_jp: デプロイメントモジュールに、 `HealthBuildItem` を生成するビルドステップを追加します。

source: Add a build step to register the providing class:
ja_jp: 提供クラスを登録するためのビルドステップを追加します。

source: Add a build step to your processor to register a Jackson module via the `JacksonModuleBuildItem`. You need to name your module in a unique way across all Jackson modules.
ja_jp: プロセッサーにビルドステップを追加して、 `JacksonModuleBuildItem` を介して Jackson モジュールを登録します。すべての Jackson モジュールで一意のモジュール名を付ける必要があります。

source: Add a build step to your processor to register the serializer via the `JsonbSerializerBuildItem`.
ja_jp: プロセッサーにビルドステップを追加して、 `JsonbSerializerBuildItem` を介してシリアライザーを登録します。

source: Add a changeLog file to the default folder following the Liquibase naming conventions: `{change-log}` The yaml, json, xml and sql changeLog file formats are also supported.
ja_jp: Liquibase の命名規則に従って、デフォルトのフォルダーに changeLog ファイルを追加します: `{change-log}` yaml, json, xml, sql changeLog ファイル形式もサポートされています。

source: Add a changeLog file to the default folder following the Liquibase naming conventions: `{change-log}` YAML, JSON and XML formats are supported for the changeLog.
ja_jp: Liquibase の命名規則に従って、デフォルトフォルダに変更ログファイルを追加します: `{change-log}` 変更ログは、YAML、JSON、XML 形式がサポートされています。

source: Add a custom HTTP response header.
ja_jp: カスタム HTTP レスポンスヘッダーを追加します。

source: Add a dependency on the artifact that contains the proto file to your project
ja_jp: protoファイルを含むアーティファクトへの依存関係をプロジェクトに追加する。

source: Add a dependency on the artifact that contains the proto file to your project.
ja_jp: proto ファイルを含むアーティファクトへの依存関係をプロジェクトに追加します。

source: Add a dependency on the artifacts providing the additional tools that are under the following Maven coordinates:
ja_jp: 次の Maven コーディネートの下にある追加ツールを提供するアーティファクトに依存関係を追加します。

source: Add a dependency to `quarkus-jackson-spi` on your extension's deployment module.
ja_jp: エクステンションのデプロイメントモジュールの `quarkus-jackson-spi` に依存関係を追加します。

source: Add a dependency to `quarkus-jsonb-spi` on your extension's deployment module.
ja_jp: エクステンションのデプロイメントモジュールで `quarkus-jsonb-spi` に依存関係を追加。

source: Add a fallback method to `CoffeeResource` and a `@Fallback` annotation to `CoffeeResource#recommendations()` method as follows:
ja_jp: `CoffeeResource` にフォールバック・メソッドを、 `CoffeeResource#recommendations()` メソッドに `@Fallback` アノテーションを以下のように追加します。

source: Add a footer tab
ja_jp: フッタータブの追加

source: Add a log to the footer
ja_jp: フッターにログを追加する

source: Add a logging adapter library to ensure that messages logged through these APIs are routed to the JBoss Log Manager backend.
ja_jp: ロギングアダプターライブラリーを追加して、これらの API を通じてログ記録されたメッセージが JBoss Log Manager バックエンドにルーティングされるようにします。

source: Add a logging adapter to your application
ja_jp: アプリケーションにロギングアダプタを追加

source: Add a logging filter to your log handler
ja_jp: ログハンドラーに対するロギングフィルタの追加

source: Add a method that will get executed on application startup.
ja_jp: アプリケーションの起動時に実行されるメソッドを追加します。

source: Add a prerequisites section
ja_jp: 前提条件セクションの追加

source: Add a second REST method to `GreetingResource`.
ja_jp: `GreetingResource` に 2 番目の REST メソッドを追加します。

source: Add a section menu
ja_jp: セクションメニューの追加

source: Add a way to disable the extension health check via a config item `quarkus.<extension>.health.enabled` that should be enabled by default.
ja_jp: 設定アイテム `quarkus.<extension> を介して、デフォルトでは有効になっているエクステンションのヘルスチェックを無効にする方法を追加します。

source: Add additional capabilities
ja_jp: 機能の追加

source: Add all files to the repository: `git add .`.
ja_jp: すべてのファイルをリポジトリーに追加します: `git add .`

source: Add an `authorization_details` query parameter with `OidcRedirectFilter`
ja_jp: `OidcRedirectFilter` で `authorization_details` クエリーパラメーターを追加する

source: Add an abstract
ja_jp: 概要の追加

source: Add an abstract that describes the purpose of the guide.
ja_jp: ガイドの目的を説明する要約を追加します。

source: Add an abstract to describe the purpose of the guide.
ja_jp: ガイドの目的を説明するための要約を追加する。

source: Add an additional query parameter. Note that the query names and values are URL-encoded by Quarkus OIDC; in this case, a `redirect-filtered=true%20C` query parameter is added to the redirect URI.
ja_jp: 追加のクエリーパラメーターを追加します。 クエリーの名前と値は Quarkus OIDC によって URL エンコードされることに注意してください。この場合、リダイレクト URI に `redirect-filtered=true%20C` クエリーパラメーターが追加されます。

source: Add an additional query parameter. Note the queury names and values are URL-encoded by Quarkus OIDC, a `redirect-filtered=true%20C` query parameter is added to the redirect URI in this case.
ja_jp: クエリーパラメーターを追加します。クエリーの名前と値は Quarkus OIDC によって URL エンコードされることに注意してください。この場合、リダイレクト URI に `redirect-filtered=true%20C` クエリーパラメーターが追加されます。

source: Add an attribute to the counter. This will create a dimension called `attribute.name` with value `attribute value`.
ja_jp: カウンターに属性を追加します。 これにより、値が `attribute value` の `attribute.name` ディメンションが作成されます。

source: Add an attribute to the histogram. This will create a dimension called `attribute.name` with value `value`.
ja_jp: ヒストグラムに属性を追加します。 これにより、値が `value` の `attribute.name` ディメンションが作成されます。

source: Add an optional `name` property to the `GreetingProperties`:
ja_jp: `GreetingProperties` クラスに新しいオプションの `name` プロパティを追加してください。

source: Add and read MDC data
ja_jp: MDCデータの追加と読込

source: Add another language (it is recommended to provide Java and Kotlin).
ja_jp: 別の言語を追加します (Java と Kotlin を提供することをお勧めします)。

source: Add beans using Spring annotations
ja_jp: Springアノテーションを使用したBeanの追加

source: Add business automation capabilities with Kogito
ja_jp: Kogito でビジネスオートメーション機能を追加する

source: Add cert-manager extension support https://github.com/fabric8io/kubernetes-client/pull/2930[#2930] (merged)
ja_jp: cert-manager エクステンションサポートの追加 link:https://github.com/fabric8io/kubernetes-client/pull/2930[#2930](merged)

source: Add custom queries on your entities inside the entities themselves. That way, you and your co-workers can find them easily, and queries are co-located with the object they operate on. Adding them as static methods in your entity class is the Panache Active Record way.
ja_jp: エンティティに対するカスタムクエリを、エンティティ自体の中に追加できます。そうすることで、自分や同僚が簡単に見つけることができ、クエリは操作するオブジェクトと一緒に配置されます。エンティティクラスにスタティックメソッドとして追加するのがPanache Active Recordのやり方です。

source: Add dependencies to project
ja_jp: プロジェクトに依存関係を追加する

source: Add following into the src/main/resources/application.properties file (create the file if it does not exist)
ja_jp: src/main/resources/application.propertiesファイルに以下を追加します(存在しない場合は作成してください)。

source: Add following two methods to our `CoffeeResource` endpoint. Again, no need to restart the server, just paste the code and save the file.
ja_jp: `CoffeeResource` エンドポイントに以下の 2 つのメソッドを追加します。ここでもサーバーを再起動する必要はなく、コードを貼り付けてファイルを保存するだけです。

source: Add full pages
ja_jp: ページ全体の追加

source: Add global flag to disable Dev Services
ja_jp: Dev Servicesを無効にするグローバル・フラグの追加

source: Add hostAliases
ja_jp: hostAliases の追加

source: Add i18n to your pages
ja_jp: ページに i18n を追加

source: Add links to an extension card
ja_jp: エクステンションカードにリンクを追加

source: Add new fruits to the list via the form.
ja_jp: フォームを使って新しいフルーツをリストに追加します。

source: Add nodeSelector
ja_jp: ノードセレクターの追加

source: Add one of the following dependencies to your project:
ja_jp: プロジェクトに以下の依存関係のいずれかを追加します。

source: Add readiness and liveness probes
ja_jp: rediness および liveness プローブを追加する

source: Add system properties to `maven-surefire-plugin`. + `maven.home` is only required if you have custom configuration in `${maven.home}/conf/settings.xml`.
ja_jp: システムのプロパティーを `maven-surefire-plugin` に追加します。+ `maven.home` は、 `${maven.home}/conf/settings.xml` にカスタム設定がある場合にのみ必要です。

source: Add test properties to the `src/main/resources/application.properties` file:
ja_jp: テストプロパティーを `src/main/resources/application.properties` ファイルに追加します。

source: Add the Maven build plugin configuration in `runtime/pom.xml` (to generate the codestart artifact: `/target/quarkus-aloha-VERSION-codestarts.jar`):
ja_jp: Maven ビルドプラグイン設定を `runtime/pom.xml` に追加します (Codestart アーティファクトを生成するには: `/target/quarkus-aloha-VERSION-codestarts.jar` ):

source: Add the Quarkus Grafana OTel LGTM sink (where data goes) extension to your build file:
ja_jp: Quarkus Grafana OTel LGTM シンク (データが送信される場所) エクステンションをビルドファイルに追加します。

source: Add the Quarkus Kubernetes extension to your build file:
ja_jp: Quarkus Kubernetes エクステンションをビルドファイルに追加します。

source: Add the Quarkus Security extension
ja_jp: Quarkus Security エクステンションを追加する

source: Add the Quarkus gRPC extension to your build file:
ja_jp: ビルドファイルにQuarkus gRPCエクステンションを追加します：

source: Add the Quarkus gRPC xDS extension to your build file:
ja_jp: Quarkus gRPC xDSエクステンションをビルドファイルに追加します：

source: Add the `--gradle` switch if you want to generate a gradle project.
ja_jp: gradleプロジェクトを生成したい場合は、 `--gradle` スイッチを追加します。

source: Add the `.env` file to `.gitignore`.
ja_jp: `.env` ファイルを `.gitignore` に追加します。

source: Add the `/new-config` path to the tenant configuration, including custom claims and values that are populated programmatically.
ja_jp: プログラムによって設定されるカスタムクレームと値を含む、テナント設定に `/new-config` パスを追加します。

source: Add the `@MyInterceptorBinding` annotation.
ja_jp: `@MyInterceptorBinding` アノテーションを追加します。

source: Add the `RestClientWithOidcClientFilter` REST client:
ja_jp: `RestClientWithOidcClientFilter` REST クライアントを追加します。

source: Add the `RestClientWithTokenHeaderParam` REST client:
ja_jp: `RestClientWithTokenHeaderParam` REST クライアントを追加します。

source: Add the `RestClientWithTokenPropagationFilter` REST client:
ja_jp: `RestClientWithTokenPropagationFilter` REST クライアントを追加します。

source: Add the `Sign In with LinkedIn using OpenId Connect` product:
ja_jp: OpenId Connect を使用して LinkedIn でサインイン製品を追加します。
